//** @file
//   Strings for H2oUve Sample Form utility DXE
//
//;******************************************************************************
//;* Copyright (c) 2016, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************


#include "Standard.uni"

#string STR_BLANK_STRING                                                   #language en-US " "
                                                                           #language fr-FR " "
                                                                           #language zh-TW " "
                                                                           #language ja-JP " "
                                                                           #language it-IT " "
                                                                           #language es-ES " "
                                                                           #language de-DE " "
                                                                           #language pt-PT " "	
#string STR_DISABLED_TEXT                                                  #language en-US "Disabled"
                                                                           #language fr-FR "Désactiver"
                                                                           #language zh-TW "\wide停用\narrow"
                                                                           #language ja-JP "\wide使用しない\narrow"
                                                                           #language it-IT "Disabilitato"
                                                                           #language es-ES "inhabilitado"
                                                                           #language de-DE "Sperren"
                                                                           #language pt-PT "Proibir"
#string STR_ENABLED_TEXT                                                   #language en-US "Enabled"
                                                                           #language fr-FR "Activer"
                                                                           #language zh-TW "\wide啟用\narrow"
                                                                           #language ja-JP "\wide使用する\narrow"
                                                                           #language it-IT "abilitato"
                                                                           #language es-ES "permitido"
                                                                           #language de-DE "Aktivieren"
                                                                           #language pt-PT "Permitir"

#string STR_NAME_VALUE_VAR_NAME0                                           #language en-US "MyNameValue0"
													 
//
// Formset H2OUVE_SAMPLE_FORM_GUID 
//
#string STR_H2OUVE_SAMPLE_FORM_PAGE_FORMSET                                     #language en-US "H2oUve Sample Form"
#string STR_H2OUVE_SAMPLE_FORM_PAGE_FORMSET_HELP                                #language en-US "Sample Form for H2oUve debugging"

//
// VFR_FORMID_H2OUVE_SAMPLE_FORM_PAGE
//
#string STR_SAMPLE_FORM_STRING0                            #language en-US        "Prompt String0"
#string STR_SAMPLE_FORM_STRING1                            #language en-US        "Prompt String1"
#string STR_SAMPLE_FORM_STRING2                            #language en-US        "Prompt String2"
#string STR_SAMPLE_FORM_STRING3                            #language en-US        "Prompt String3"
#string STR_SAMPLE_FORM_STRING4                            #language en-US        "Prompt String4"
#string STR_SAMPLE_FORM_STRING5                            #language en-US        "Prompt String5"
#string STR_SAMPLE_FORM_STRING6                            #language en-US        "Prompt String6"
#string STR_SAMPLE_FORM_STRING7                            #language en-US        "Prompt String7"
#string STR_SAMPLE_FORM_STRING8                            #language en-US        "Prompt String8"
#string STR_SAMPLE_FORM_STRING9                            #language en-US        "Prompt String9"
#string STR_SAMPLE_FORM_STRING10                           #language en-US        "Prompt String10"
#string STR_SAMPLE_FORM_STRING11                           #language en-US        "Prompt String11"
#string STR_SAMPLE_FORM_STRING12                           #language en-US        "Prompt String12"
#string STR_SAMPLE_FORM_STRING13                           #language en-US        "Prompt String13"
#string STR_SAMPLE_FORM_STRING14                           #language en-US        "Prompt String14"
#string STR_SAMPLE_FORM_STRING15                           #language en-US        "Prompt String15"
#string STR_SAMPLE_FORM_STRING16                           #language en-US        "Prompt String16"
#string STR_SAMPLE_FORM_HELP                               #language en-US        "Help String"

#string STR_OPTION_1_STRING                              #language en-US        "Option 1"
#string STR_OPTION_2_STRING                              #language en-US        "Option 2"
#string STR_OPTION_3_STRING                              #language en-US        "Option 3"
#string STR_OPTION_4_STRING                              #language en-US        "Option 4"
#string STR_OPTION_5_STRING                              #language en-US        "Option 5"
#string STR_OPTION_6_STRING                              #language en-US        "Option 6"
#string STR_OPTION_7_STRING                              #language en-US        "Option 7"

#string STR_SAMPLE_TIME_PROMPT          #language en-US       "Time"
                                        #language fr-FR       "Temps Système"
                                        #language zh-TW       "\wide系統時間\narrow"
                                        #language ja-JP       "\wideシステム時刻\narrow"
                                        #language it-IT       "Ora sistema"
                                        #language es-ES       "Tiempo de Sistema"
                                        #language de-DE       "Systemzeit"
                                        #language pt-PT       "Tempo de Sistema"
										
#string STR_SAMPLE_TIME_HELP            #language en-US        "This is the help for the hour, minute, second field. Valid range is from 0 to 23, 0 to 59, 0 to 59. INCREASE/REDUCE : +/-."
                                        #language fr-FR        "C'est utile pour regler l'heure, l'minute, l'Seconde. Champsvalide est de 0 à 23, 0 à 59, 0 à 59. AUGEMENTER/REDUIRE : +/-."
                                        #language zh-TW       "\wide時\narrow \wide的有效值範圍從\narrow 0 \wide至\narrow 23.\wide分\narrow \wide的有效值範圍從\narrow 0 \wide至\narrow 59.\wide秒\narrow \wide的有效值範圍從\narrow 0 \wide至\narrow 59."
                                        #language ja-JP       "\wide現在の時刻を、時\narrow:\wide分\narrow:\wide秒で設定します。\narrow(\wide時\narrow:0~23) \narrow(\wide分\narrow:0~59) \narrow(\wide秒\narrow:0~59)      <Pg Up>\wideまたは\narrow<SPACE>\wideキーで設定します。\narrow                                <Pg Dn> \wideキーで設定\narrow      \wideします。\narrow                                       <Tab> \wideキーで右の項目に移動します。\narrow"
                                        #language it-IT       "Assistenza per campo ora, minuti, Secondi. Raggio valido da 0 a 23, 0 a 59, 0 a 59. AUMENTO/RIDUZIONE : +/-."
                                        #language es-ES       "Ésta es la ayuda para el campo de la hora, minuto, Segundo. La gama válida es a partir de 0 a 23, 0 a 59, 0 a 59. INCREASE/REDUCE: +/-."
                                        #language de-DE       "Das ist die Hilfe für das Stundenfeld, Minutefeld, Sekundefeld. Gültiger Bereich ist von 0 bis 23, 0 bis 59, 0 bis 59. ZUNAHME/ABNAHME: +/-."
                                        #language pt-PT       "Esta é uma ajuda para hora, Minuto, Segundo. A escala válida é de 0 a 23, 0 a 59, 0 a 59. AUMENTAR/REDUZIR: +/-"

#string STR_SAMPLE_DATE_PROMPT          #language en-US       "Date"
                                        #language fr-FR       "Date Système"
                                        #language zh-TW       "\wide系統日期\narrow"
                                        #language ja-JP       "\wideシステム日付\narrow"
                                        #language it-IT       "Data del sistema"
                                        #language es-ES       "Fecha de Sistema"
                                        #language de-DE       "Systemdatum"
                                        #language pt-PT       "Data de Sistema"

#string STR_SAMPLE_DATE_HELP            #language en-US        "This is the help for the month field, day field, year field. Valid range is from 1 to 12, 1 to 31, 2000 to 2099. (Error checking will be done against month/day/year combinations that are not supported.) INCREASE/REDUCE : +/-."
                                        #language fr-FR        "C'est utile pour regler l'mois, l'jour, l'an. Champsvalide est de 1 à 12, 1 à 31, 2000 à 2099. (Verification incorrecte sera contre les combinaison de mois/jour/an qui sont pas supportées.) AUGEMENTER/REDUIRE : +/-."
                                        #language zh-TW       "\wide月\narrow \wide的有效值範圍從\narrow 1 \wide至\narrow 12. \wide日\narrow \wide的有效值範圍從\narrow 1 \wide至\narrow 31. \wide年\narrow \wide的有效值範圍從\narrow 2000 \wide至\narrow 2099. (\wide若輸入不符\narrow month/day/year\wide組合\narrow, \wide將會自動偵錯\narrow.)"
                                        #language ja-JP       "\wide現在の日付を、\wide月\narrow/\wide日\narrow/\wide年で設定します。\narrow(\wide月\narrow:1~12) \narrow(\wide日\narrow:1~31) (\wide年\narrow:2000~2099)                         <Pg Up>\wideまたは\narrow<SPACE>\wideキーで設定します。\narrow                                  <Pg Dn> \wideキーで設定\narrow      \wideします。\narrow                                       <Tab> \wideキーで右の項目に移動します。\narrow"
                                        #language it-IT       "Assistenza per campo mese, giorno, anno. Raggio valido da 1 a 12, 1 a 31, 2000 a 2099. AUMENTO/RIDUZIONE : +/-."
                                        #language es-ES       "Ésta es la ayuda para el campo de la mes, día, año. La gama válida es a partir de 1 a 12, 1 a 31, 2000 a 2099. INCREASE/REDUCE: +/-."
                                        #language de-DE       "Das ist die Hilfe für das Monatfeld, Tagfeld, Jahrfeld. Gültiger Bereich ist von 1 bis 12, 1 bis 31, 2000 bis 2099. ZUNAHME/ABNAHME: +/-."
                                        #language pt-PT       "Esta é uma ajuda para Mês, Dia, Ano. A escala válida é de 1 a 12, 1 a 31, 2000 a 2099. AUMENTAR/REDUZIR: +/-"                                        
	

#string STR_STANDARD_DEFAULT_PROMPT                           #language en-US        "StandardDefault"
#string STR_MANUFACTURE_DEFAULT_PROMPT                        #language en-US        "ManufactureDefault"

#string STR_PASSWORD_SAMPLE                                   #language en-US        "PasswordSample"

#string STR_SAMPLEFORM_VERSION                                #language en-US        "Ver 00.01"
	
//
// End of file
//